scripts/job-script.yml
config:
  target: "https://appqa.clicktime.com/Rest/v2/"
  processor: "../faker.js"
  phases:
    - duration: 1
      arrivalCount: 1
  defaults:
    headers:
      Content-Type: "application/json"
      Cookie: "{{ cookieAuth }}"
      
scenarios:
  - flow:

  # Jobs
    - function: "cookie"
    - function: "generageJobData"
    - post:
        name: "Create new job"
        url: "/Jobs"
        json:
          ClientID: "4N74rlRefUN9P64BblHAPmA2"
          Name: "{{ name }}"
          JobNumber: "{{$randomNumber(1, 200)}}"
          IsActive: true
          IsBillable: true
          BillingRate: 300
          AccountingPackageID: null
        capture:
          - json: "$.data.ID"
            as: "new_clientid"
          - json: "$."
            as: "error"

    - delete:
        url: "/Jobs/{{ new_clientid }}"